{
  "ir_version": "1.0.0",
  "graph_schema_version": "1.0",
  "source": {
    "text": "S core cron\nCr L_scrape \"0 0 * * *\"\n\nL_scrape:\n  R http.Get \"https://example.com/products\" ->resp\n  R db.C Product * ->stored\n  J stored\n\n",
    "lines": [
      "S core cron",
      "Cr L_scrape \"0 0 * * *\"",
      "",
      "L_scrape:",
      "  R http.Get \"https://example.com/products\" ->resp",
      "  R db.C Product * ->stored",
      "  J stored",
      "",
      ""
    ]
  },
  "cst": {
    "lines": [
      {
        "lineno": 1,
        "original_line": "S core cron",
        "op_value": "S",
        "op_canonical": "S",
        "slot_values": [
          "core",
          "cron"
        ],
        "slot_kinds": [
          "bare",
          "bare"
        ],
        "tokens": [
          {
            "kind": "bare",
            "raw": "S",
            "value": "S",
            "span": {
              "line": 1,
              "col_start": 0,
              "col_end": 1
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 1,
              "col_start": 1,
              "col_end": 2
            }
          },
          {
            "kind": "bare",
            "raw": "core",
            "value": "core",
            "span": {
              "line": 1,
              "col_start": 2,
              "col_end": 6
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 1,
              "col_start": 6,
              "col_end": 7
            }
          },
          {
            "kind": "bare",
            "raw": "cron",
            "value": "cron",
            "span": {
              "line": 1,
              "col_start": 7,
              "col_end": 11
            }
          }
        ]
      },
      {
        "lineno": 2,
        "original_line": "Cr L_scrape \"0 0 * * *\"",
        "op_value": "Cr",
        "op_canonical": "Cr",
        "slot_values": [
          "L_scrape",
          "0 0 * * *"
        ],
        "slot_kinds": [
          "bare",
          "string"
        ],
        "tokens": [
          {
            "kind": "bare",
            "raw": "Cr",
            "value": "Cr",
            "span": {
              "line": 2,
              "col_start": 0,
              "col_end": 2
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 2,
              "col_start": 2,
              "col_end": 3
            }
          },
          {
            "kind": "bare",
            "raw": "L_scrape",
            "value": "L_scrape",
            "span": {
              "line": 2,
              "col_start": 3,
              "col_end": 11
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 2,
              "col_start": 11,
              "col_end": 12
            }
          },
          {
            "kind": "string",
            "raw": "\"0 0 * * *\"",
            "value": "0 0 * * *",
            "span": {
              "line": 2,
              "col_start": 12,
              "col_end": 23
            }
          }
        ]
      },
      {
        "lineno": 3,
        "original_line": "",
        "op_value": "",
        "op_canonical": "",
        "slot_values": [],
        "slot_kinds": [],
        "tokens": []
      },
      {
        "lineno": 4,
        "original_line": "L_scrape:",
        "op_value": "L_scrape:",
        "op_canonical": "L_scrape:",
        "slot_values": [],
        "slot_kinds": [],
        "tokens": [
          {
            "kind": "bare",
            "raw": "L_scrape:",
            "value": "L_scrape:",
            "span": {
              "line": 4,
              "col_start": 0,
              "col_end": 9
            }
          }
        ]
      },
      {
        "lineno": 5,
        "original_line": "  R http.Get \"https://example.com/products\" ->resp",
        "op_value": "R",
        "op_canonical": "R",
        "slot_values": [
          "http.Get",
          "https://example.com/products",
          "->resp"
        ],
        "slot_kinds": [
          "bare",
          "string",
          "bare"
        ],
        "tokens": [
          {
            "kind": "ws",
            "raw": "  ",
            "value": "  ",
            "span": {
              "line": 5,
              "col_start": 0,
              "col_end": 2
            }
          },
          {
            "kind": "bare",
            "raw": "R",
            "value": "R",
            "span": {
              "line": 5,
              "col_start": 2,
              "col_end": 3
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 5,
              "col_start": 3,
              "col_end": 4
            }
          },
          {
            "kind": "bare",
            "raw": "http.Get",
            "value": "http.Get",
            "span": {
              "line": 5,
              "col_start": 4,
              "col_end": 12
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 5,
              "col_start": 12,
              "col_end": 13
            }
          },
          {
            "kind": "string",
            "raw": "\"https://example.com/products\"",
            "value": "https://example.com/products",
            "span": {
              "line": 5,
              "col_start": 13,
              "col_end": 43
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 5,
              "col_start": 43,
              "col_end": 44
            }
          },
          {
            "kind": "bare",
            "raw": "->resp",
            "value": "->resp",
            "span": {
              "line": 5,
              "col_start": 44,
              "col_end": 50
            }
          }
        ]
      },
      {
        "lineno": 6,
        "original_line": "  R db.C Product * ->stored",
        "op_value": "R",
        "op_canonical": "R",
        "slot_values": [
          "db.C",
          "Product",
          "*",
          "->stored"
        ],
        "slot_kinds": [
          "bare",
          "bare",
          "bare",
          "bare"
        ],
        "tokens": [
          {
            "kind": "ws",
            "raw": "  ",
            "value": "  ",
            "span": {
              "line": 6,
              "col_start": 0,
              "col_end": 2
            }
          },
          {
            "kind": "bare",
            "raw": "R",
            "value": "R",
            "span": {
              "line": 6,
              "col_start": 2,
              "col_end": 3
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 6,
              "col_start": 3,
              "col_end": 4
            }
          },
          {
            "kind": "bare",
            "raw": "db.C",
            "value": "db.C",
            "span": {
              "line": 6,
              "col_start": 4,
              "col_end": 8
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 6,
              "col_start": 8,
              "col_end": 9
            }
          },
          {
            "kind": "bare",
            "raw": "Product",
            "value": "Product",
            "span": {
              "line": 6,
              "col_start": 9,
              "col_end": 16
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 6,
              "col_start": 16,
              "col_end": 17
            }
          },
          {
            "kind": "bare",
            "raw": "*",
            "value": "*",
            "span": {
              "line": 6,
              "col_start": 17,
              "col_end": 18
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 6,
              "col_start": 18,
              "col_end": 19
            }
          },
          {
            "kind": "bare",
            "raw": "->stored",
            "value": "->stored",
            "span": {
              "line": 6,
              "col_start": 19,
              "col_end": 27
            }
          }
        ]
      },
      {
        "lineno": 7,
        "original_line": "  J stored",
        "op_value": "J",
        "op_canonical": "J",
        "slot_values": [
          "stored"
        ],
        "slot_kinds": [
          "bare"
        ],
        "tokens": [
          {
            "kind": "ws",
            "raw": "  ",
            "value": "  ",
            "span": {
              "line": 7,
              "col_start": 0,
              "col_end": 2
            }
          },
          {
            "kind": "bare",
            "raw": "J",
            "value": "J",
            "span": {
              "line": 7,
              "col_start": 2,
              "col_end": 3
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 7,
              "col_start": 3,
              "col_end": 4
            }
          },
          {
            "kind": "bare",
            "raw": "stored",
            "value": "stored",
            "span": {
              "line": 7,
              "col_start": 4,
              "col_end": 10
            }
          }
        ]
      },
      {
        "lineno": 8,
        "original_line": "",
        "op_value": "",
        "op_canonical": "",
        "slot_values": [],
        "slot_kinds": [],
        "tokens": []
      },
      {
        "lineno": 9,
        "original_line": "",
        "op_value": "",
        "op_canonical": "",
        "slot_values": [],
        "slot_kinds": [],
        "tokens": []
      }
    ]
  },
  "services": {
    "core": {
      "mode": "cron",
      "path": "",
      "eps": {},
      "ui": {}
    }
  },
  "types": {},
  "labels": {
    "_scrape": {
      "nodes": [
        {
          "id": "n1",
          "op": "R",
          "effect": "io",
          "reads": [],
          "writes": [
            "resp"
          ],
          "lineno": 5,
          "data": {
            "op": "R",
            "lineno": 5,
            "adapter": "http.Get",
            "target": "https://example.com/products",
            "args": [],
            "out": "resp",
            "src": "http",
            "req_op": "GET",
            "entity": "https://example.com/products",
            "fields": "*",
            "raw": [
              "http.Get",
              "https://example.com/products",
              "->resp"
            ]
          },
          "effect_tier": "io-read",
          "effect_kinds": [
            "http"
          ],
          "hash": "sha256:4fbcd3f9805d793d0395a7487bc4f7c02c08a6e70b5319075bb4304fcfecd3e3"
        },
        {
          "id": "n2",
          "op": "R",
          "effect": "io",
          "reads": [],
          "writes": [
            "stored"
          ],
          "lineno": 6,
          "data": {
            "op": "R",
            "lineno": 6,
            "adapter": "db.C",
            "target": "Product",
            "args": [
              "*"
            ],
            "out": "stored",
            "src": "db",
            "req_op": "C",
            "entity": "Product",
            "fields": "*",
            "raw": [
              "db.C",
              "Product",
              "*",
              "->stored"
            ]
          },
          "effect_tier": "io-write",
          "effect_kinds": [
            "db_write"
          ],
          "hash": "sha256:52e2952e673d43c3928f231aa5f3c2bec692a6219c62c404f1a932f2e943ce89"
        },
        {
          "id": "n3",
          "op": "J",
          "effect": "pure",
          "reads": [
            "stored"
          ],
          "writes": [],
          "lineno": 7,
          "data": {
            "op": "J",
            "lineno": 7,
            "var": "stored"
          },
          "effect_tier": "pure",
          "effect_kinds": [],
          "hash": "sha256:57c2abe551b16efeb52902e55d03ab55227cc11cd447e823239e73dcc0817a4f"
        }
      ],
      "edges": [
        {
          "from": "n1",
          "to": "n2",
          "to_kind": "node",
          "port": "next"
        },
        {
          "from": "n2",
          "to": "n3",
          "to_kind": "node",
          "port": "next"
        }
      ],
      "legacy": {
        "steps": [
          {
            "op": "R",
            "lineno": 5,
            "adapter": "http.Get",
            "target": "https://example.com/products",
            "args": [],
            "out": "resp",
            "src": "http",
            "req_op": "GET",
            "entity": "https://example.com/products",
            "fields": "*",
            "raw": [
              "http.Get",
              "https://example.com/products",
              "->resp"
            ]
          },
          {
            "op": "R",
            "lineno": 6,
            "adapter": "db.C",
            "target": "Product",
            "args": [
              "*"
            ],
            "out": "stored",
            "src": "db",
            "req_op": "C",
            "entity": "Product",
            "fields": "*",
            "raw": [
              "db.C",
              "Product",
              "*",
              "->stored"
            ]
          },
          {
            "op": "J",
            "lineno": 7,
            "var": "stored"
          }
        ]
      },
      "slots": [],
      "entry": "n1",
      "exits": [
        {
          "node": "n3",
          "var": "stored"
        }
      ],
      "effect_summary": {
        "reads": [
          "stored"
        ],
        "writes": [
          "resp",
          "stored"
        ],
        "effects": [
          "db_write",
          "http"
        ]
      },
      "id_hash": "sha256:c4496710ddacbc08da199e5d04275bc0569f96e33bcfad66b1c62bcd79a50cd6"
    }
  },
  "crons": [
    {
      "label": "L_scrape",
      "expr": "0 0 * * *"
    }
  ],
  "config": {
    "env": [],
    "secrets": []
  },
  "observability": {
    "metrics": [],
    "trace": false
  },
  "deploy": {
    "strategy": "rolling",
    "env_target": "",
    "flags": []
  },
  "limits": {
    "per_path": {},
    "per_tenant": 0
  },
  "roles": [],
  "allow": [],
  "audit": {},
  "admin": {},
  "desc": {
    "endpoints": {},
    "types": {}
  },
  "runbooks": {},
  "ver": null,
  "compat": null,
  "tests": [],
  "api": {
    "style": "rest",
    "version_prefix": "",
    "deprecate": [],
    "sla": {}
  },
  "rag": {
    "sources": {},
    "chunking": {},
    "embeddings": {},
    "stores": {},
    "indexes": {},
    "retrievers": {},
    "augment": {},
    "generate": {},
    "pipelines": {}
  },
  "capabilities": {
    "auth": {},
    "policy": {},
    "cache": {},
    "queue": {},
    "txn": {}
  },
  "runtime_policy": {
    "execution_mode": "graph-preferred",
    "unknown_op_policy": "skip"
  },
  "meta": [],
  "errors": [],
  "warnings": [],
  "diagnostics": [],
  "stats": {
    "lines": 6,
    "ops": 6
  },
  "graph_semantic_checksum": "sha256:0767cfed00ad32c6893c30e1e677bbc4f0b8c3f0c9132048cd6581be7ee0e24e"
}
