{
  "ir_version": "1.0.0",
  "graph_schema_version": "1.0",
  "source": {
    "text": "# Ecom dashboard \u2014 API + frontend (AINL 1.0)\n# Webserver at /api (core) + static at / (fe). All behavior defined here.\n\nS core web /api\nS fe web /\n\n# Data\nD Product id:I name:S price:F sku:S\nD Order id:I uid:I total:F status:E[Pending,Paid,Shipped]\nD Customer id:I email:S name:S\n\n# Products API\nE /products G ->L1 ->products\nL1: R db.F Product * ->products J products\n\nE /product G ->L6 ->product\nL6: R db.G Product id ->product J product\n\nE /products P ->L7 ->product\nL7: R db.C Product name price sku ->product J product\n\n# Orders API\nE /orders G ->L2 ->orders\nL2: R db.F Order * ->orders J orders\n\nE /order G ->L8 ->order\nL8: R db.G Order id ->order J order\n\nE /orders P ->L9 ->order\nL9: R db.C Order uid total status ->order J order\n\n# Checkout (payment definition is top-level; in-label use R pay.* when needed)\nE /checkout P ->L3\nL3: R db.F Order * ->ord J ord\n\nP checkout 1999 usd \"Order payment\"\n\n# Customers API\nE /customers G ->L10 ->customers\nL10: R db.F Customer * ->customers J customers\n\n# Frontend: routes, layout, UI, forms, tables, events\nRt / Dashboard\nRt /products ProductList\nRt /orders OrderTable\nRt /customers CustomerTable\n\nLay Shell Sidebar Main\n\nU Dashboard\nT products:A[Product]\nT orders:A[Order]\nT customers:A[Customer]\nU ProductList products\nU OrderTable orders\nU CustomerTable customers\nU CheckoutBtn\n\nFm OrderForm Order id uid total status\nFm ProductForm Product id name price sku\nTbl OrderTable Order id uid total status\nTbl ProductList Product id name price sku\nTbl CustomerTable Customer id email name\n\nEv CheckoutBtn click /checkout\n\nC cart sessionId 3600\n",
    "lines": [
      "# Ecom dashboard \u2014 API + frontend (AINL 1.0)",
      "# Webserver at /api (core) + static at / (fe). All behavior defined here.",
      "",
      "S core web /api",
      "S fe web /",
      "",
      "# Data",
      "D Product id:I name:S price:F sku:S",
      "D Order id:I uid:I total:F status:E[Pending,Paid,Shipped]",
      "D Customer id:I email:S name:S",
      "",
      "# Products API",
      "E /products G ->L1 ->products",
      "L1: R db.F Product * ->products J products",
      "",
      "E /product G ->L6 ->product",
      "L6: R db.G Product id ->product J product",
      "",
      "E /products P ->L7 ->product",
      "L7: R db.C Product name price sku ->product J product",
      "",
      "# Orders API",
      "E /orders G ->L2 ->orders",
      "L2: R db.F Order * ->orders J orders",
      "",
      "E /order G ->L8 ->order",
      "L8: R db.G Order id ->order J order",
      "",
      "E /orders P ->L9 ->order",
      "L9: R db.C Order uid total status ->order J order",
      "",
      "# Checkout (payment definition is top-level; in-label use R pay.* when needed)",
      "E /checkout P ->L3",
      "L3: R db.F Order * ->ord J ord",
      "",
      "P checkout 1999 usd \"Order payment\"",
      "",
      "# Customers API",
      "E /customers G ->L10 ->customers",
      "L10: R db.F Customer * ->customers J customers",
      "",
      "# Frontend: routes, layout, UI, forms, tables, events",
      "Rt / Dashboard",
      "Rt /products ProductList",
      "Rt /orders OrderTable",
      "Rt /customers CustomerTable",
      "",
      "Lay Shell Sidebar Main",
      "",
      "U Dashboard",
      "T products:A[Product]",
      "T orders:A[Order]",
      "T customers:A[Customer]",
      "U ProductList products",
      "U OrderTable orders",
      "U CustomerTable customers",
      "U CheckoutBtn",
      "",
      "Fm OrderForm Order id uid total status",
      "Fm ProductForm Product id name price sku",
      "Tbl OrderTable Order id uid total status",
      "Tbl ProductList Product id name price sku",
      "Tbl CustomerTable Customer id email name",
      "",
      "Ev CheckoutBtn click /checkout",
      "",
      "C cart sessionId 3600",
      ""
    ]
  },
  "cst": {
    "lines": [
      {
        "lineno": 1,
        "original_line": "# Ecom dashboard \u2014 API + frontend (AINL 1.0)",
        "op_value": "",
        "op_canonical": "",
        "slot_values": [],
        "slot_kinds": [],
        "tokens": [
          {
            "kind": "comment",
            "raw": "# Ecom dashboard \u2014 API + frontend (AINL 1.0)",
            "value": "# Ecom dashboard \u2014 API + frontend (AINL 1.0)",
            "span": {
              "line": 1,
              "col_start": 0,
              "col_end": 44
            }
          }
        ]
      },
      {
        "lineno": 2,
        "original_line": "# Webserver at /api (core) + static at / (fe). All behavior defined here.",
        "op_value": "",
        "op_canonical": "",
        "slot_values": [],
        "slot_kinds": [],
        "tokens": [
          {
            "kind": "comment",
            "raw": "# Webserver at /api (core) + static at / (fe). All behavior defined here.",
            "value": "# Webserver at /api (core) + static at / (fe). All behavior defined here.",
            "span": {
              "line": 2,
              "col_start": 0,
              "col_end": 73
            }
          }
        ]
      },
      {
        "lineno": 3,
        "original_line": "",
        "op_value": "",
        "op_canonical": "",
        "slot_values": [],
        "slot_kinds": [],
        "tokens": []
      },
      {
        "lineno": 4,
        "original_line": "S core web /api",
        "op_value": "S",
        "op_canonical": "S",
        "slot_values": [
          "core",
          "web",
          "/api"
        ],
        "slot_kinds": [
          "bare",
          "bare",
          "bare"
        ],
        "tokens": [
          {
            "kind": "bare",
            "raw": "S",
            "value": "S",
            "span": {
              "line": 4,
              "col_start": 0,
              "col_end": 1
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 4,
              "col_start": 1,
              "col_end": 2
            }
          },
          {
            "kind": "bare",
            "raw": "core",
            "value": "core",
            "span": {
              "line": 4,
              "col_start": 2,
              "col_end": 6
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 4,
              "col_start": 6,
              "col_end": 7
            }
          },
          {
            "kind": "bare",
            "raw": "web",
            "value": "web",
            "span": {
              "line": 4,
              "col_start": 7,
              "col_end": 10
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 4,
              "col_start": 10,
              "col_end": 11
            }
          },
          {
            "kind": "bare",
            "raw": "/api",
            "value": "/api",
            "span": {
              "line": 4,
              "col_start": 11,
              "col_end": 15
            }
          }
        ]
      },
      {
        "lineno": 5,
        "original_line": "S fe web /",
        "op_value": "S",
        "op_canonical": "S",
        "slot_values": [
          "fe",
          "web",
          "/"
        ],
        "slot_kinds": [
          "bare",
          "bare",
          "bare"
        ],
        "tokens": [
          {
            "kind": "bare",
            "raw": "S",
            "value": "S",
            "span": {
              "line": 5,
              "col_start": 0,
              "col_end": 1
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 5,
              "col_start": 1,
              "col_end": 2
            }
          },
          {
            "kind": "bare",
            "raw": "fe",
            "value": "fe",
            "span": {
              "line": 5,
              "col_start": 2,
              "col_end": 4
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 5,
              "col_start": 4,
              "col_end": 5
            }
          },
          {
            "kind": "bare",
            "raw": "web",
            "value": "web",
            "span": {
              "line": 5,
              "col_start": 5,
              "col_end": 8
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 5,
              "col_start": 8,
              "col_end": 9
            }
          },
          {
            "kind": "bare",
            "raw": "/",
            "value": "/",
            "span": {
              "line": 5,
              "col_start": 9,
              "col_end": 10
            }
          }
        ]
      },
      {
        "lineno": 6,
        "original_line": "",
        "op_value": "",
        "op_canonical": "",
        "slot_values": [],
        "slot_kinds": [],
        "tokens": []
      },
      {
        "lineno": 7,
        "original_line": "# Data",
        "op_value": "",
        "op_canonical": "",
        "slot_values": [],
        "slot_kinds": [],
        "tokens": [
          {
            "kind": "comment",
            "raw": "# Data",
            "value": "# Data",
            "span": {
              "line": 7,
              "col_start": 0,
              "col_end": 6
            }
          }
        ]
      },
      {
        "lineno": 8,
        "original_line": "D Product id:I name:S price:F sku:S",
        "op_value": "D",
        "op_canonical": "D",
        "slot_values": [
          "Product",
          "id:I",
          "name:S",
          "price:F",
          "sku:S"
        ],
        "slot_kinds": [
          "bare",
          "bare",
          "bare",
          "bare",
          "bare"
        ],
        "tokens": [
          {
            "kind": "bare",
            "raw": "D",
            "value": "D",
            "span": {
              "line": 8,
              "col_start": 0,
              "col_end": 1
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 8,
              "col_start": 1,
              "col_end": 2
            }
          },
          {
            "kind": "bare",
            "raw": "Product",
            "value": "Product",
            "span": {
              "line": 8,
              "col_start": 2,
              "col_end": 9
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 8,
              "col_start": 9,
              "col_end": 10
            }
          },
          {
            "kind": "bare",
            "raw": "id:I",
            "value": "id:I",
            "span": {
              "line": 8,
              "col_start": 10,
              "col_end": 14
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 8,
              "col_start": 14,
              "col_end": 15
            }
          },
          {
            "kind": "bare",
            "raw": "name:S",
            "value": "name:S",
            "span": {
              "line": 8,
              "col_start": 15,
              "col_end": 21
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 8,
              "col_start": 21,
              "col_end": 22
            }
          },
          {
            "kind": "bare",
            "raw": "price:F",
            "value": "price:F",
            "span": {
              "line": 8,
              "col_start": 22,
              "col_end": 29
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 8,
              "col_start": 29,
              "col_end": 30
            }
          },
          {
            "kind": "bare",
            "raw": "sku:S",
            "value": "sku:S",
            "span": {
              "line": 8,
              "col_start": 30,
              "col_end": 35
            }
          }
        ]
      },
      {
        "lineno": 9,
        "original_line": "D Order id:I uid:I total:F status:E[Pending,Paid,Shipped]",
        "op_value": "D",
        "op_canonical": "D",
        "slot_values": [
          "Order",
          "id:I",
          "uid:I",
          "total:F",
          "status:E[Pending,Paid,Shipped]"
        ],
        "slot_kinds": [
          "bare",
          "bare",
          "bare",
          "bare",
          "bare"
        ],
        "tokens": [
          {
            "kind": "bare",
            "raw": "D",
            "value": "D",
            "span": {
              "line": 9,
              "col_start": 0,
              "col_end": 1
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 9,
              "col_start": 1,
              "col_end": 2
            }
          },
          {
            "kind": "bare",
            "raw": "Order",
            "value": "Order",
            "span": {
              "line": 9,
              "col_start": 2,
              "col_end": 7
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 9,
              "col_start": 7,
              "col_end": 8
            }
          },
          {
            "kind": "bare",
            "raw": "id:I",
            "value": "id:I",
            "span": {
              "line": 9,
              "col_start": 8,
              "col_end": 12
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 9,
              "col_start": 12,
              "col_end": 13
            }
          },
          {
            "kind": "bare",
            "raw": "uid:I",
            "value": "uid:I",
            "span": {
              "line": 9,
              "col_start": 13,
              "col_end": 18
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 9,
              "col_start": 18,
              "col_end": 19
            }
          },
          {
            "kind": "bare",
            "raw": "total:F",
            "value": "total:F",
            "span": {
              "line": 9,
              "col_start": 19,
              "col_end": 26
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 9,
              "col_start": 26,
              "col_end": 27
            }
          },
          {
            "kind": "bare",
            "raw": "status:E[Pending,Paid,Shipped]",
            "value": "status:E[Pending,Paid,Shipped]",
            "span": {
              "line": 9,
              "col_start": 27,
              "col_end": 57
            }
          }
        ]
      },
      {
        "lineno": 10,
        "original_line": "D Customer id:I email:S name:S",
        "op_value": "D",
        "op_canonical": "D",
        "slot_values": [
          "Customer",
          "id:I",
          "email:S",
          "name:S"
        ],
        "slot_kinds": [
          "bare",
          "bare",
          "bare",
          "bare"
        ],
        "tokens": [
          {
            "kind": "bare",
            "raw": "D",
            "value": "D",
            "span": {
              "line": 10,
              "col_start": 0,
              "col_end": 1
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 10,
              "col_start": 1,
              "col_end": 2
            }
          },
          {
            "kind": "bare",
            "raw": "Customer",
            "value": "Customer",
            "span": {
              "line": 10,
              "col_start": 2,
              "col_end": 10
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 10,
              "col_start": 10,
              "col_end": 11
            }
          },
          {
            "kind": "bare",
            "raw": "id:I",
            "value": "id:I",
            "span": {
              "line": 10,
              "col_start": 11,
              "col_end": 15
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 10,
              "col_start": 15,
              "col_end": 16
            }
          },
          {
            "kind": "bare",
            "raw": "email:S",
            "value": "email:S",
            "span": {
              "line": 10,
              "col_start": 16,
              "col_end": 23
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 10,
              "col_start": 23,
              "col_end": 24
            }
          },
          {
            "kind": "bare",
            "raw": "name:S",
            "value": "name:S",
            "span": {
              "line": 10,
              "col_start": 24,
              "col_end": 30
            }
          }
        ]
      },
      {
        "lineno": 11,
        "original_line": "",
        "op_value": "",
        "op_canonical": "",
        "slot_values": [],
        "slot_kinds": [],
        "tokens": []
      },
      {
        "lineno": 12,
        "original_line": "# Products API",
        "op_value": "",
        "op_canonical": "",
        "slot_values": [],
        "slot_kinds": [],
        "tokens": [
          {
            "kind": "comment",
            "raw": "# Products API",
            "value": "# Products API",
            "span": {
              "line": 12,
              "col_start": 0,
              "col_end": 14
            }
          }
        ]
      },
      {
        "lineno": 13,
        "original_line": "E /products G ->L1 ->products",
        "op_value": "E",
        "op_canonical": "E",
        "slot_values": [
          "/products",
          "G",
          "->L1",
          "->products"
        ],
        "slot_kinds": [
          "bare",
          "bare",
          "bare",
          "bare"
        ],
        "tokens": [
          {
            "kind": "bare",
            "raw": "E",
            "value": "E",
            "span": {
              "line": 13,
              "col_start": 0,
              "col_end": 1
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 13,
              "col_start": 1,
              "col_end": 2
            }
          },
          {
            "kind": "bare",
            "raw": "/products",
            "value": "/products",
            "span": {
              "line": 13,
              "col_start": 2,
              "col_end": 11
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 13,
              "col_start": 11,
              "col_end": 12
            }
          },
          {
            "kind": "bare",
            "raw": "G",
            "value": "G",
            "span": {
              "line": 13,
              "col_start": 12,
              "col_end": 13
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 13,
              "col_start": 13,
              "col_end": 14
            }
          },
          {
            "kind": "bare",
            "raw": "->L1",
            "value": "->L1",
            "span": {
              "line": 13,
              "col_start": 14,
              "col_end": 18
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 13,
              "col_start": 18,
              "col_end": 19
            }
          },
          {
            "kind": "bare",
            "raw": "->products",
            "value": "->products",
            "span": {
              "line": 13,
              "col_start": 19,
              "col_end": 29
            }
          }
        ]
      },
      {
        "lineno": 14,
        "original_line": "L1: R db.F Product * ->products J products",
        "op_value": "L1:",
        "op_canonical": "L1:",
        "slot_values": [
          "R",
          "db.F",
          "Product",
          "*",
          "->products",
          "J",
          "products"
        ],
        "slot_kinds": [
          "bare",
          "bare",
          "bare",
          "bare",
          "bare",
          "bare",
          "bare"
        ],
        "tokens": [
          {
            "kind": "bare",
            "raw": "L1:",
            "value": "L1:",
            "span": {
              "line": 14,
              "col_start": 0,
              "col_end": 3
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 14,
              "col_start": 3,
              "col_end": 4
            }
          },
          {
            "kind": "bare",
            "raw": "R",
            "value": "R",
            "span": {
              "line": 14,
              "col_start": 4,
              "col_end": 5
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 14,
              "col_start": 5,
              "col_end": 6
            }
          },
          {
            "kind": "bare",
            "raw": "db.F",
            "value": "db.F",
            "span": {
              "line": 14,
              "col_start": 6,
              "col_end": 10
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 14,
              "col_start": 10,
              "col_end": 11
            }
          },
          {
            "kind": "bare",
            "raw": "Product",
            "value": "Product",
            "span": {
              "line": 14,
              "col_start": 11,
              "col_end": 18
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 14,
              "col_start": 18,
              "col_end": 19
            }
          },
          {
            "kind": "bare",
            "raw": "*",
            "value": "*",
            "span": {
              "line": 14,
              "col_start": 19,
              "col_end": 20
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 14,
              "col_start": 20,
              "col_end": 21
            }
          },
          {
            "kind": "bare",
            "raw": "->products",
            "value": "->products",
            "span": {
              "line": 14,
              "col_start": 21,
              "col_end": 31
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 14,
              "col_start": 31,
              "col_end": 32
            }
          },
          {
            "kind": "bare",
            "raw": "J",
            "value": "J",
            "span": {
              "line": 14,
              "col_start": 32,
              "col_end": 33
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 14,
              "col_start": 33,
              "col_end": 34
            }
          },
          {
            "kind": "bare",
            "raw": "products",
            "value": "products",
            "span": {
              "line": 14,
              "col_start": 34,
              "col_end": 42
            }
          }
        ]
      },
      {
        "lineno": 15,
        "original_line": "",
        "op_value": "",
        "op_canonical": "",
        "slot_values": [],
        "slot_kinds": [],
        "tokens": []
      },
      {
        "lineno": 16,
        "original_line": "E /product G ->L6 ->product",
        "op_value": "E",
        "op_canonical": "E",
        "slot_values": [
          "/product",
          "G",
          "->L6",
          "->product"
        ],
        "slot_kinds": [
          "bare",
          "bare",
          "bare",
          "bare"
        ],
        "tokens": [
          {
            "kind": "bare",
            "raw": "E",
            "value": "E",
            "span": {
              "line": 16,
              "col_start": 0,
              "col_end": 1
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 16,
              "col_start": 1,
              "col_end": 2
            }
          },
          {
            "kind": "bare",
            "raw": "/product",
            "value": "/product",
            "span": {
              "line": 16,
              "col_start": 2,
              "col_end": 10
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 16,
              "col_start": 10,
              "col_end": 11
            }
          },
          {
            "kind": "bare",
            "raw": "G",
            "value": "G",
            "span": {
              "line": 16,
              "col_start": 11,
              "col_end": 12
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 16,
              "col_start": 12,
              "col_end": 13
            }
          },
          {
            "kind": "bare",
            "raw": "->L6",
            "value": "->L6",
            "span": {
              "line": 16,
              "col_start": 13,
              "col_end": 17
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 16,
              "col_start": 17,
              "col_end": 18
            }
          },
          {
            "kind": "bare",
            "raw": "->product",
            "value": "->product",
            "span": {
              "line": 16,
              "col_start": 18,
              "col_end": 27
            }
          }
        ]
      },
      {
        "lineno": 17,
        "original_line": "L6: R db.G Product id ->product J product",
        "op_value": "L6:",
        "op_canonical": "L6:",
        "slot_values": [
          "R",
          "db.G",
          "Product",
          "id",
          "->product",
          "J",
          "product"
        ],
        "slot_kinds": [
          "bare",
          "bare",
          "bare",
          "bare",
          "bare",
          "bare",
          "bare"
        ],
        "tokens": [
          {
            "kind": "bare",
            "raw": "L6:",
            "value": "L6:",
            "span": {
              "line": 17,
              "col_start": 0,
              "col_end": 3
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 17,
              "col_start": 3,
              "col_end": 4
            }
          },
          {
            "kind": "bare",
            "raw": "R",
            "value": "R",
            "span": {
              "line": 17,
              "col_start": 4,
              "col_end": 5
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 17,
              "col_start": 5,
              "col_end": 6
            }
          },
          {
            "kind": "bare",
            "raw": "db.G",
            "value": "db.G",
            "span": {
              "line": 17,
              "col_start": 6,
              "col_end": 10
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 17,
              "col_start": 10,
              "col_end": 11
            }
          },
          {
            "kind": "bare",
            "raw": "Product",
            "value": "Product",
            "span": {
              "line": 17,
              "col_start": 11,
              "col_end": 18
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 17,
              "col_start": 18,
              "col_end": 19
            }
          },
          {
            "kind": "bare",
            "raw": "id",
            "value": "id",
            "span": {
              "line": 17,
              "col_start": 19,
              "col_end": 21
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 17,
              "col_start": 21,
              "col_end": 22
            }
          },
          {
            "kind": "bare",
            "raw": "->product",
            "value": "->product",
            "span": {
              "line": 17,
              "col_start": 22,
              "col_end": 31
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 17,
              "col_start": 31,
              "col_end": 32
            }
          },
          {
            "kind": "bare",
            "raw": "J",
            "value": "J",
            "span": {
              "line": 17,
              "col_start": 32,
              "col_end": 33
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 17,
              "col_start": 33,
              "col_end": 34
            }
          },
          {
            "kind": "bare",
            "raw": "product",
            "value": "product",
            "span": {
              "line": 17,
              "col_start": 34,
              "col_end": 41
            }
          }
        ]
      },
      {
        "lineno": 18,
        "original_line": "",
        "op_value": "",
        "op_canonical": "",
        "slot_values": [],
        "slot_kinds": [],
        "tokens": []
      },
      {
        "lineno": 19,
        "original_line": "E /products P ->L7 ->product",
        "op_value": "E",
        "op_canonical": "E",
        "slot_values": [
          "/products",
          "P",
          "->L7",
          "->product"
        ],
        "slot_kinds": [
          "bare",
          "bare",
          "bare",
          "bare"
        ],
        "tokens": [
          {
            "kind": "bare",
            "raw": "E",
            "value": "E",
            "span": {
              "line": 19,
              "col_start": 0,
              "col_end": 1
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 19,
              "col_start": 1,
              "col_end": 2
            }
          },
          {
            "kind": "bare",
            "raw": "/products",
            "value": "/products",
            "span": {
              "line": 19,
              "col_start": 2,
              "col_end": 11
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 19,
              "col_start": 11,
              "col_end": 12
            }
          },
          {
            "kind": "bare",
            "raw": "P",
            "value": "P",
            "span": {
              "line": 19,
              "col_start": 12,
              "col_end": 13
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 19,
              "col_start": 13,
              "col_end": 14
            }
          },
          {
            "kind": "bare",
            "raw": "->L7",
            "value": "->L7",
            "span": {
              "line": 19,
              "col_start": 14,
              "col_end": 18
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 19,
              "col_start": 18,
              "col_end": 19
            }
          },
          {
            "kind": "bare",
            "raw": "->product",
            "value": "->product",
            "span": {
              "line": 19,
              "col_start": 19,
              "col_end": 28
            }
          }
        ]
      },
      {
        "lineno": 20,
        "original_line": "L7: R db.C Product name price sku ->product J product",
        "op_value": "L7:",
        "op_canonical": "L7:",
        "slot_values": [
          "R",
          "db.C",
          "Product",
          "name",
          "price",
          "sku",
          "->product",
          "J",
          "product"
        ],
        "slot_kinds": [
          "bare",
          "bare",
          "bare",
          "bare",
          "bare",
          "bare",
          "bare",
          "bare",
          "bare"
        ],
        "tokens": [
          {
            "kind": "bare",
            "raw": "L7:",
            "value": "L7:",
            "span": {
              "line": 20,
              "col_start": 0,
              "col_end": 3
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 20,
              "col_start": 3,
              "col_end": 4
            }
          },
          {
            "kind": "bare",
            "raw": "R",
            "value": "R",
            "span": {
              "line": 20,
              "col_start": 4,
              "col_end": 5
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 20,
              "col_start": 5,
              "col_end": 6
            }
          },
          {
            "kind": "bare",
            "raw": "db.C",
            "value": "db.C",
            "span": {
              "line": 20,
              "col_start": 6,
              "col_end": 10
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 20,
              "col_start": 10,
              "col_end": 11
            }
          },
          {
            "kind": "bare",
            "raw": "Product",
            "value": "Product",
            "span": {
              "line": 20,
              "col_start": 11,
              "col_end": 18
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 20,
              "col_start": 18,
              "col_end": 19
            }
          },
          {
            "kind": "bare",
            "raw": "name",
            "value": "name",
            "span": {
              "line": 20,
              "col_start": 19,
              "col_end": 23
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 20,
              "col_start": 23,
              "col_end": 24
            }
          },
          {
            "kind": "bare",
            "raw": "price",
            "value": "price",
            "span": {
              "line": 20,
              "col_start": 24,
              "col_end": 29
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 20,
              "col_start": 29,
              "col_end": 30
            }
          },
          {
            "kind": "bare",
            "raw": "sku",
            "value": "sku",
            "span": {
              "line": 20,
              "col_start": 30,
              "col_end": 33
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 20,
              "col_start": 33,
              "col_end": 34
            }
          },
          {
            "kind": "bare",
            "raw": "->product",
            "value": "->product",
            "span": {
              "line": 20,
              "col_start": 34,
              "col_end": 43
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 20,
              "col_start": 43,
              "col_end": 44
            }
          },
          {
            "kind": "bare",
            "raw": "J",
            "value": "J",
            "span": {
              "line": 20,
              "col_start": 44,
              "col_end": 45
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 20,
              "col_start": 45,
              "col_end": 46
            }
          },
          {
            "kind": "bare",
            "raw": "product",
            "value": "product",
            "span": {
              "line": 20,
              "col_start": 46,
              "col_end": 53
            }
          }
        ]
      },
      {
        "lineno": 21,
        "original_line": "",
        "op_value": "",
        "op_canonical": "",
        "slot_values": [],
        "slot_kinds": [],
        "tokens": []
      },
      {
        "lineno": 22,
        "original_line": "# Orders API",
        "op_value": "",
        "op_canonical": "",
        "slot_values": [],
        "slot_kinds": [],
        "tokens": [
          {
            "kind": "comment",
            "raw": "# Orders API",
            "value": "# Orders API",
            "span": {
              "line": 22,
              "col_start": 0,
              "col_end": 12
            }
          }
        ]
      },
      {
        "lineno": 23,
        "original_line": "E /orders G ->L2 ->orders",
        "op_value": "E",
        "op_canonical": "E",
        "slot_values": [
          "/orders",
          "G",
          "->L2",
          "->orders"
        ],
        "slot_kinds": [
          "bare",
          "bare",
          "bare",
          "bare"
        ],
        "tokens": [
          {
            "kind": "bare",
            "raw": "E",
            "value": "E",
            "span": {
              "line": 23,
              "col_start": 0,
              "col_end": 1
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 23,
              "col_start": 1,
              "col_end": 2
            }
          },
          {
            "kind": "bare",
            "raw": "/orders",
            "value": "/orders",
            "span": {
              "line": 23,
              "col_start": 2,
              "col_end": 9
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 23,
              "col_start": 9,
              "col_end": 10
            }
          },
          {
            "kind": "bare",
            "raw": "G",
            "value": "G",
            "span": {
              "line": 23,
              "col_start": 10,
              "col_end": 11
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 23,
              "col_start": 11,
              "col_end": 12
            }
          },
          {
            "kind": "bare",
            "raw": "->L2",
            "value": "->L2",
            "span": {
              "line": 23,
              "col_start": 12,
              "col_end": 16
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 23,
              "col_start": 16,
              "col_end": 17
            }
          },
          {
            "kind": "bare",
            "raw": "->orders",
            "value": "->orders",
            "span": {
              "line": 23,
              "col_start": 17,
              "col_end": 25
            }
          }
        ]
      },
      {
        "lineno": 24,
        "original_line": "L2: R db.F Order * ->orders J orders",
        "op_value": "L2:",
        "op_canonical": "L2:",
        "slot_values": [
          "R",
          "db.F",
          "Order",
          "*",
          "->orders",
          "J",
          "orders"
        ],
        "slot_kinds": [
          "bare",
          "bare",
          "bare",
          "bare",
          "bare",
          "bare",
          "bare"
        ],
        "tokens": [
          {
            "kind": "bare",
            "raw": "L2:",
            "value": "L2:",
            "span": {
              "line": 24,
              "col_start": 0,
              "col_end": 3
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 24,
              "col_start": 3,
              "col_end": 4
            }
          },
          {
            "kind": "bare",
            "raw": "R",
            "value": "R",
            "span": {
              "line": 24,
              "col_start": 4,
              "col_end": 5
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 24,
              "col_start": 5,
              "col_end": 6
            }
          },
          {
            "kind": "bare",
            "raw": "db.F",
            "value": "db.F",
            "span": {
              "line": 24,
              "col_start": 6,
              "col_end": 10
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 24,
              "col_start": 10,
              "col_end": 11
            }
          },
          {
            "kind": "bare",
            "raw": "Order",
            "value": "Order",
            "span": {
              "line": 24,
              "col_start": 11,
              "col_end": 16
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 24,
              "col_start": 16,
              "col_end": 17
            }
          },
          {
            "kind": "bare",
            "raw": "*",
            "value": "*",
            "span": {
              "line": 24,
              "col_start": 17,
              "col_end": 18
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 24,
              "col_start": 18,
              "col_end": 19
            }
          },
          {
            "kind": "bare",
            "raw": "->orders",
            "value": "->orders",
            "span": {
              "line": 24,
              "col_start": 19,
              "col_end": 27
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 24,
              "col_start": 27,
              "col_end": 28
            }
          },
          {
            "kind": "bare",
            "raw": "J",
            "value": "J",
            "span": {
              "line": 24,
              "col_start": 28,
              "col_end": 29
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 24,
              "col_start": 29,
              "col_end": 30
            }
          },
          {
            "kind": "bare",
            "raw": "orders",
            "value": "orders",
            "span": {
              "line": 24,
              "col_start": 30,
              "col_end": 36
            }
          }
        ]
      },
      {
        "lineno": 25,
        "original_line": "",
        "op_value": "",
        "op_canonical": "",
        "slot_values": [],
        "slot_kinds": [],
        "tokens": []
      },
      {
        "lineno": 26,
        "original_line": "E /order G ->L8 ->order",
        "op_value": "E",
        "op_canonical": "E",
        "slot_values": [
          "/order",
          "G",
          "->L8",
          "->order"
        ],
        "slot_kinds": [
          "bare",
          "bare",
          "bare",
          "bare"
        ],
        "tokens": [
          {
            "kind": "bare",
            "raw": "E",
            "value": "E",
            "span": {
              "line": 26,
              "col_start": 0,
              "col_end": 1
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 26,
              "col_start": 1,
              "col_end": 2
            }
          },
          {
            "kind": "bare",
            "raw": "/order",
            "value": "/order",
            "span": {
              "line": 26,
              "col_start": 2,
              "col_end": 8
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 26,
              "col_start": 8,
              "col_end": 9
            }
          },
          {
            "kind": "bare",
            "raw": "G",
            "value": "G",
            "span": {
              "line": 26,
              "col_start": 9,
              "col_end": 10
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 26,
              "col_start": 10,
              "col_end": 11
            }
          },
          {
            "kind": "bare",
            "raw": "->L8",
            "value": "->L8",
            "span": {
              "line": 26,
              "col_start": 11,
              "col_end": 15
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 26,
              "col_start": 15,
              "col_end": 16
            }
          },
          {
            "kind": "bare",
            "raw": "->order",
            "value": "->order",
            "span": {
              "line": 26,
              "col_start": 16,
              "col_end": 23
            }
          }
        ]
      },
      {
        "lineno": 27,
        "original_line": "L8: R db.G Order id ->order J order",
        "op_value": "L8:",
        "op_canonical": "L8:",
        "slot_values": [
          "R",
          "db.G",
          "Order",
          "id",
          "->order",
          "J",
          "order"
        ],
        "slot_kinds": [
          "bare",
          "bare",
          "bare",
          "bare",
          "bare",
          "bare",
          "bare"
        ],
        "tokens": [
          {
            "kind": "bare",
            "raw": "L8:",
            "value": "L8:",
            "span": {
              "line": 27,
              "col_start": 0,
              "col_end": 3
            }
          },
          {
            "kind": "ws",
            "raw": " ",
            "value": " ",
            "span": {
              "line": 27,
              "col_start": 3,
              "col_end": 4
            }
          },
          {
            "kind": "bare",
            "raw": "R",
            "value": "R",
            "span": {
              "line": 27,
